Revit 2024 API
MEPNetworkSegmentData Class
 Represents the analysis data for one network segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class MEPNetworkSegmentData : IDisposable
Visual Basic
Public Class MEPNetworkSegmentData _
	Implements IDisposable
Visual C++
public ref class MEPNetworkSegmentData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData
See Also
MEPNetworkSegmentData Members
Autodesk.Revit.DB.Analysis Namespace